       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC X(12) VALUE X'48454C4C4F20574F524C4421'.
       01 B PIC 9(02) VALUE 01.
       01 C PIC X(01) VALUE X'20'.
       PROCEDURE DIVISION.
           MOVE 1 TO B
           PERFORM VARYING B FROM 1 BY 1 UNTIL B > 12
               DISPLAY A(B:1) WITH NO ADVANCING
           END-PERFORM
           DISPLAY C
           STOP RUN.